**压阻式加速度传感器**

MEMS压阻式加速度传感器的敏感元件由弹性梁、质量块、固定框组成。压阻式加速度传感器实质上是一个力传感器，他是利用用测量固定质量块在受到加速度作用时产生的力F来测得加速度a的。在目前研究尺度内，可以认为其基本原理仍遵从牛顿第二定律。也就是说当有加速度a作用于传感器时，传感器的惯性质量块便会产生一个惯性力:F=ma,此惯性力F作用于传感器的弹性梁上，便会产生一个正比于F的应变。，此时弹性梁上的压敏电阻也会随之产生一个变化量△R，由压敏电阻组成的惠斯通电桥输出一个与△R成正比的电压信号V。

![img](http://5b0988e595225.cdn.sohucs.com/images/20170907/fd184d9c302141cdb25e2008c594270c.jpeg)

**电容式加速度传感器**

电容式加速度传感器，在工业领域有着广泛的应用，例如发动机，数控车床等等。它具有电路结构简单，频率范围宽约为0～450Hz，线性度小于1%，灵敏度高，输出稳定，温度漂移小，测量误差小，稳态响应，输出阻抗低，输出电量与振动加速度的关系式简单方便易于计算等优点，具有较高的实际应用价值。

**电容式加速度传感器原理**

电容式加速度传感器是基于电容原理的极距变化型的电容传感器，其中一个电极是固定的，另一变化电极是弹性膜片。弹性膜片在外力(气压、液压等)作用下发生位移，使电容量发生变化。这种传感器可以测量气流(或液流)的振动速度(或加速度)，还可以进一步测出压力。

![img](http://5b0988e595225.cdn.sohucs.com/images/20170907/754039d8b9e24becb589ff1e54e59b40.jpeg)

**光波导加速度计**

光波导加速度计的原理如下图所示：光源从波导1进入，经过分束部分后分成两部分分别通入波导4和波导2，进入波导4的一束直接被探测器2探测，而进入波导2的一束会经过一段微小的间隙后进入波导3，最终被探测器1探测到。有加速度时，质量块会使得波导2弯曲，进而导至其与波导3的正对面积减小，使探测器1探测到的光减弱。通过比较两个探测器检测到的信号即可求得加速度。

![img](http://5b0988e595225.cdn.sohucs.com/images/20170907/483748ef1add442cb08264d8464cd9c4.jpeg)

**微谐振式加速度计**

谐振式加速度计，Silicon Oscillating Accelerometer，简称SOA。

一根琴弦绷紧程度不同时弹奏出的声音频率也不同，谐振式加速度计的原理与此相同。振梁一端固定，另一端链接一质量块，当振梁轴线方向有加速度时梁会受到轴线方向的力，梁中张力变化，其固有频率也相应发生变化。若对梁施加一确定的激振，检测其响应就可测出其固有频率，进而测出加速度。激振的施加和响应的检测通常都是通过梳齿机构实现的。

SOA的特点在于，它是通过改变二阶系统本身的特性来反映加速度的变化的，这区别与电容式、压电式和光波导式的加速度计。

SOA常见的结构有S结构和双端固定音叉（Double-ended Tuning Fork，DETF）两种。S结构原理图如下图所示，DEFT式就是在质量块的另一半加上和左边对称的一套机构。DEFT是目前SOA的主流结构。

![img](http://5b0988e595225.cdn.sohucs.com/images/20170907/a76c5d7803e54ca2a3c5ef1a0fec8607.jpeg)

**热对流加速度计**

热对流加速度的原理与其他加速度计有根本上的区别，其他加速度计的原理都是建立在一个二阶系统的基础之上，而热对流加速度计采用的是完全不同的原理。

一个被放置在芯片中央的热源在一个空腔中产生一个悬浮的热气团，同时由铝和多晶硅组成的热电偶组被等距离对称地放置在热源的四个方向。在未受到加速度或水平放置时，温度的下降陡度是以热源为中心完全对称的。此时所有四个热电偶组因感应温度而产生的电压是相同的（见下图）。由于自由对流热场的传递性，任何方向的加速度都会扰乱热场的轮廓，从而导致其不对称。此时四个热电偶组的输出电压会出现差异，而热电偶组输出电压的差异是直接与所感应的加速度成比例的。在加速度传感器内部有两条完全相同的加速度信号传输路径：一条是用于测量X轴上所感应的加速度，另一条则用于测量Y轴上所感应的加速度。

![img](http://5b0988e595225.cdn.sohucs.com/images/20170907/0632d867d5644fbd93287df5ee8974c0.jpeg)

由于热对流加速度计中没有可运动的质量块，所以其制造工艺相对简单，也比较容易加工，而且其抗冲击性能非常好，可抗五万倍重力加速度的加速度。但环境温度对热对流加速度计的影响较大，而温度变化会导致零点漂移；同时热对流加速度计的频响范围低，通常是小于35Hz。

**压电式加速度计**

压电式加速度计的数学和物理模型与压阻式和电容式的加速度计类似，都是通过测量二阶系统中质量块的位移来间接测量加速度，三者的差别就是在于测量这个质量块位移的方法。

压电式加速度计利用了压电效应，或者更确切地说，是利用了正压电效应，即某些电介质在沿一定方向上受到外力的作用而变形时其内部产生极化现象，同时在它的两个相对表面上出现正负相反的电荷。通过测量压电材料两级的电势差即可求得其形变压电原理在宏观尺度的加速度计中应用颇为广泛，这类加速度计的构造多为基座和质量块之间夹一压阻材料（如下图）。

![img](http://5b0988e595225.cdn.sohucs.com/images/20170907/d6cd98636eda4a2989475375487cf6e9.jpeg)